modules/Template/Blocks/FormSearchAllService.php

select * from `bravo_seat_type` where `bravo_seat_type`.`deleted_at` is null
---
    public function content($model = [])
    {
        $runningSearchAds = AdvertisementRequest::runningAds('large_banner', 3);
        $runningSearchAd = $runningSearchAds->first();
        $model['running_search_ad'] = $runningSearchAd;
        $model['running_search_ads'] = $runningSearchAds->map(function ($advertisement) {
            return [
                'image_url' => $advertisement->mediaUrlForPlacement('large_banner'),
                'link_url' => $advertisement->link_url ?: $advertisement->target_url ?: '#',
            ];
        })->filter(function ($advertisement) {
            return !empty($advertisement['image_url']);
        })->values()->all();
        $model['bg_image_url'] = $runningSearchAd
            ? $runningSearchAd->mediaUrlForPlacement('large_banner')
            : (FileHelper::url($model['bg_image'] ?? "", 'full') ?? "");
        $model['list_location'] = $model['tour_location'] =  Location::where("status","publish")->limit(1000)->orderBy('name', 'asc')->with(['translation'])->get()->toTree();
        $model['style'] = $model['style'] ?? "";
        $model['list_slider'] = $model['list_slider'] ?? "";
        $model['modelBlock'] = $model;
        $model['seatType'] =  SeatType::get();