modules/News/Controllers/NewsController.php

select * from `core_news_category` where 0 = 1 and `core_news_category`.`deleted_at` is null
select * from `core_news_translations` where `locale` = 'vi' and `core_news_translations`.`origin_id` in (98, 99, 100, 101, 102)
select `core_news`.* from `core_news` where `core_news`.`status` = 'publish' and `core_news`.`deleted_at` is null order by `core_news`.`id` desc limit 5 offset 20
select count(*) as aggregate from `core_news` where `core_news`.`status` = 'publish' and `core_news`.`deleted_at` is null
---
    public function index(Request $request)
    {

        $model_News = News::query()->select("core_news.*");
        $model_News->where("core_news.status", "publish")->orderBy('core_news.id', 'desc');
        if (!empty($search = $request->input("s"))) {
            $model_News->where(function($query) use ($search) {
                $query->where('core_news.title', 'LIKE', '%' . $search . '%');
                $query->orWhere('core_news.content', 'LIKE', '%' . $search . '%');
            });

            if( setting_item('site_enable_multi_lang') && setting_item('site_locale') != app_get_locale() ){
                $model_News->leftJoin('core_news_translations', function ($join) use ($search) {
                    $join->on('core_news.id', '=', 'core_news_translations.origin_id');
                });
                $model_News->orWhere(function($query) use ($search) {
                    $query->where('core_news_translations.title', 'LIKE', '%' . $search . '%');
                    $query->orWhere('core_news_translations.content', 'LIKE', '%' . $search . '%');
                });
            }

            $title_page = __('Search results : ":s"', ["s" => $search]);
        }
        $data = [
            'rows'              => $model_News->with("author")->with('translation')->with("category")->paginate(5),
            'model_category'    => NewsCategory::query()->where("status", "publish"),
            'model_tag'         => Tag::query(),
            'model_news'        => News::query()->where("status", "publish"),
            'custom_title_page' => $title_page ?? "",
            'breadcrumbs'       => [
                [
                    'name'  => __('News'),
                    'url'  => route('news.index'),
                    'class' => 'active'
                ],
            ],
            "seo_meta" => News::getSeoMetaForPageList(),
            "languages"=>Language::getActive(false),
            "locale"=> app()->getLocale(),
            'header_transparent'=>true,
        ];

select * from `core_news` where `slug` = 'forest-trekking-vietnam' and `status` = 'publish' and `core_news`.`deleted_at` is null limit 1
---
    public function detail(Request $request, $slug)
    {
        $row = News::where('slug', $slug)->where('status','publish')->first();