modules/News/Admin/NewsController.php

select * from `core_news_category` where 0 = 1 and `core_news_category`.`deleted_at` is null
select * from `core_news` where (IFNULL(lang,'') = ''  or `lang` = 'vi') and `core_news`.`deleted_at` is null order by `id` desc limit 20 offset 20
select count(*) as aggregate from `core_news` where (IFNULL(lang,'') = ''  or `lang` = 'vi') and `core_news`.`deleted_at` is null
select * from `core_news_category` where `core_news_category`.`deleted_at` is null
---
    public function index(Request $request)

    {

        $this->checkPermission('news_view');
        $dataNews = News::query()->orderBy('id', 'desc');
        $post_name = $request->query('s');
        $cate = $request->query('cate_id');
        if ($cate) {
           $dataNews->where('cat_id', $cate);
        }
        if ($post_name) {
            $dataNews->where('title', 'LIKE', '%' . $post_name . '%');
            $dataNews->orderBy('title', 'asc');
        }


        $this->filterLang($dataNews);

        $data = [
            'rows'        => $dataNews->with("author")->with("category")->paginate(20),
            'categories'  => NewsCategory::get(),
            'breadcrumbs' => [
                [
                    'name' => __('News'),
                    'url'  => route('news.admin.index')
                ],
                [
                    'name'  => __('All'),
                    'class' => 'active'
                ],
            ],
            "languages"=>Language::getActive(false),
            "locale"=>\App::getLocale(),
            'page_title'=>__("News Management")
        ];

select * from `core_news` where `core_news`.`id` = '185' and `core_news`.`deleted_at` is null limit 1
select * from `core_news_category` where `core_news_category`.`deleted_at` is null
---
    public function edit(Request $request, $id)
    {
        $this->checkPermission('news_update');

        $row = News::find($id);

        $translation = $row->translate($request->query('lang',get_main_lang()));

        if (empty($row)) {
            return redirect(route('news.admin.index'));
        }

        $data = [
            'row'  => $row,
            'translation'  => $translation,
            'categories' => NewsCategory::get()->toTree(),

select * from `core_news` where `core_news`.`id` = '188' and `core_news`.`deleted_at` is null limit 1
---
    public function store(Request $request, $id){
        if(is_demo_mode()){
            return redirect()->back()->with('danger',__("DEMO MODE: Disable update"));
        }
        if($id>0){
            $this->checkPermission('news_update');
            $row = News::find($id);